{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "48ab131d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# table style\n",
    "import pandas\n",
    "pandas.set_option('display.max_colwidth', 500)\n",
    "pandas.set_option('html.use_mathjax', False)\n",
    "\n",
    "\n",
    "# custom node colors\n",
    "colors = {\n",
    "    ':Start': 'green',\n",
    "    ':Module': 'red'\n",
    "}\n",
    "\n",
    "# custom graph layout\n",
    "layout = {\n",
    "    'layout': 'cola', \n",
    "    'padding': 100,\n",
    "    'nodeSpacing': 100\n",
    "}\n",
    "\n",
    "# custom node captions (default is `LabelName`)\n",
    "caption = {':CompressedNode': ['name']}\n",
    "\n",
    "# connect neo4j with jupyter\n",
    "%reload_ext cy2py\n",
    "\n",
    "# url and credential\n",
    "neo4j_url = \"bolt://localhost:7687\"\n",
    "neo4j_user = \"neo4j\"\n",
    "neo4j_pwd = \"apoc1234\"\n",
    "\n",
    "# we check the connections and set the above custom options\n",
    "%cypher -u $neo4j_url -us $neo4j_user -pw $neo4j_pwd \\\n",
    "    -co $colors -la $layout -ca $caption \\\n",
    "    RETURN true AS connected"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ab0c101",
   "metadata": {},
   "source": [
    "<hr style=\"border:1px solid #ccc\"> \n",
    "\n",
    "# Redis\n",
    "\n",
    "<span style=\"color:#33f\" size=\"7\"> ***For 4.4, introduced in APOC Extended/Full 4.4.0.3*** </span>\n",
    "\n",
    "We have the possibility to interface to Redis, \n",
    "by emulating a lot of commands via APOC procedures.\n",
    "\n",
    "Since redis is an in-memory data structure key-value store, \n",
    "it can be used to cache Neo4j data\n",
    "and to utilize the various functions that Redis provides, such as ttl.\n",
    "\n",
    "#### The structure of all procedures is:\n",
    "\n",
    "```\n",
    "apoc.redis.commandName(<connectionStringUrl>, ...1 or more params, $configOptionalMap) YIELD value\n",
    "```\n",
    "\n",
    "`connectionStringUrl` is `redis://<REDIS_PASSWORD>@<HOST>:<PORT_NUM>`\n",
    "\n",
    "`$configOptionalMap` can have:\n",
    "\n",
    "- `charset`: String (default \"UTF-8\") - The charset to encode keys and values\n",
    "\n",
    "\n",
    "- `timeout`: long (60) - timeout in seconds\n",
    "\n",
    "\n",
    "- `scriptCharset`: String (default \"UTF-8\") - The Lua script charset to encode scripts\n",
    "\n",
    "\n",
    "- `autoReconnect`: boolean (default true) - Enables or disables auto reconnection on connection loss\n",
    "\n",
    "\n",
    "- `right`: boolean (default true) - To choose the direction case of procedure with \"two sides\", for example in apoc.redis.push to choose between RPUSH and LPUSH (right/left push)\n",
    "\n",
    "\n",
    "- `codec`: `\"STRING\"` (default) or `\"BYTE_ARRAY\"`. With `BYTE_ARRAY` use byte[] to read and write keys and values. More info [here](https://lettuce.io/core/release/reference/#codecs) \n",
    "    \n",
    "#### Note\n",
    "```\n",
    "To use this procedure we need to download an additional jar\n",
    "https://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/download/<APOC_VERSION>/apoc-redis-dependencies-<APOC_VERSION>-all.jar,\n",
    "and put in the `plugin` folder.\n",
    "\n",
    "So for example with apoc 5.1.0, `https://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/download/5.1.0/apoc-redis-dependencies-5.1.0-all.jar`.\n",
    "\n",
    "```\n",
    "\n",
    "\n",
    "For these examples we created a simple empty Redis container with host `redis:6379` and password \"redisPass\" :\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13018e1f",
   "metadata": {},
   "source": [
    "### Redis String commands\n",
    "\n",
    "\n",
    "\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr>\n",
    "        <td>apoc.redis.getSet('url', 'myKey', 'myValue')</td>\n",
    "        <td>GETSET mykey \"myValue\"</td>\n",
    "    </tr>\n",
    "    <tr>\n",
    "        <td>apoc.redis.get('url', 'myKey')</td>\n",
    "        <td>GET mykey</td>\n",
    "    </tr>\n",
    "    <tr>\n",
    "        <td>apoc.redis.incrby('url', 'myKey', increment)</td>\n",
    "        <td>INCRBY key increment</td>\n",
    "    </tr>\n",
    "    <tr>\n",
    "        <td>apoc.redis.append('url', 'myKey', 'appendVal')</td>\n",
    "        <td>APPEND myKey 'appendVal'</td>\n",
    "    </tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ffa3243",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// uri => \"redis://redisPass@redis:6379\"\n",
    "\n",
    "// equivalent to redis `GETSET key value` command, i.e. set a value and returns the previous one\n",
    "CALL apoc.redis.getSet(\"redis://redisPass@redis:6379\", 'myKey', 'myValue')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bc1a1abf",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// equivalent to redis `GET key` command\n",
    "CALL apoc.redis.get(\"redis://redisPass@redis:6379\", 'myKey')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2486e713",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "\n",
    "// with codec `BYTE_ARRAY`, key and value have to be byte[]\n",
    "\n",
    "CALL apoc.redis.getSet(\"redis://redisPass@redis:6379\", \n",
    "                       apoc.util.compress('myBytesKey', {compression: 'NONE'}), \n",
    "                       apoc.util.compress('myBytesValue', {compression: 'NONE'}), \n",
    "                       {codec: 'BYTE_ARRAY'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fff49a62",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// equivalent to redis `GETSET key value` command, i.e. set a value and returns the previous one\n",
    "CALL apoc.redis.get(\"redis://redisPass@redis:6379\", \n",
    "                    apoc.util.compress('myBytesKey', {compression: 'NONE'}), \n",
    "                    {codec: 'BYTE_ARRAY'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3f5433a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "\n",
    "// equivalent to redis `GETSET key value` command, i.e. set a value and returns the previous one\n",
    "CALL apoc.redis.get(\"redis://redisPass@redis:6379\", \n",
    "                    apoc.util.compress('myBytesKey', {compression: 'NONE'}), \n",
    "                    {codec: 'STRING'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b0cfead9",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// returns the new string size\n",
    "CALL apoc.redis.append(\"redis://redisPass@redis:6379\", 'myKey', 'appendValue')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25275a12",
   "metadata": {},
   "source": [
    "\n",
    "### Redis list commands\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.redis.lrange(uri, key, start, stop,, config)</td><td>LRANGE key start stop\n",
    "</td></tr>\n",
    "    <tr><td>CALL apoc.redis.push(uri, key, values, {right: false})</td><td>LPUSH key field values</td></tr>\n",
    "    <tr><td>CALL apoc.redis.push(uri, key, values, {right: true})</td><td>RPUSH key field values</td></tr>\n",
    "    <tr><td>CALL apoc.redis.pop(uri, listKey, {right: false})</td><td>LPOP key</td></tr>\n",
    "    <tr><td>CALL apoc.redis.pop(uri, listKey, {right: true})</td><td>RPOP key</td></tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n",
    "<br>\n",
    "\n",
    "### Redis set commands\n",
    "\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.redis.sadd(uri, key, members, config)</td><td>SADD key members</td></tr>\n",
    "    <tr><td>CALL apoc.redis.sunion(uri, keys, config)</td><td>SUNION keys</td></tr>\n",
    "    <tr><td>CALL apoc.redis.scard(uri, key, config)</td><td>SCARD key</td></tr>\n",
    "    <tr><td>CALL apoc.redis.smembers(uri, key, config)</td><td>SMEMBERS key</td></tr>\n",
    "    <tr><td>CALL apoc.redis.spop(uri, key, config)</td><td>SPOP key</td></tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n",
    "### Redis sorted set commands\n",
    "\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.redis.zadd(uri, key, scoreAndMembers, config)</td><td>ZADD key scoresAndMembers</td></tr>\n",
    "    <tr><td>CALL apoc.redis.zcard(uri, keys, config)</td><td>ZCARD key</td></tr>\n",
    "    <tr><td>CALL apoc.redis.zrangebyscore(uri, key, min, max, config)</td><td>ZRANGEBYSCORE key min max</td></tr>\n",
    "    <tr><td>CALL apoc.redis.zrem(uri, key, members, config)</td><td>ZREM key members</td></tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n",
    "### Redis hashes commands\n",
    "\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.redis.hset(uri, key, field, value, config)</td><td>HSET key field value</td></tr>\n",
    "    <tr><td>CALL apoc.redis.hdel(uri, key, fields, config)</td><td>HDEL key fields</td></tr>\n",
    "    <tr><td>CALL apoc.redis.hexists(uri, key, field, config)</td><td>HEXISTS key field</td></tr>\n",
    "    <tr><td>CALL apoc.redis.hget(uri, key, field, config)</td><td>HGET key field</td></tr>\n",
    "    <tr><td>CALL apoc.redis.hincrby(uri, key, field, amount, config)</td><td>HINCRBY key field amount</td></tr>\n",
    "    <tr><td>CALL apoc.redis.hgetall(uri, key, config)</td><td>HGETALL key</td></tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n",
    "### Redis keys commands\n",
    "\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.redis.copy(uri, from, to, config)</td><td>COPY from to</td></tr>\n",
    "    <tr><td>CALL apoc.redis.exists(uri, key, config)</td><td>EXISTS key</td></tr>\n",
    "    <tr><td>CALL apoc.redis.hexists(uri, key, field, config)</td><td>HEXISTS key field</td></tr>\n",
    "    <tr><td>CALL apoc.redis.pexpire(uri, key, time, false, config)</td><td>PEXPIRE key milliseconds</td></tr>\n",
    "    <tr><td>CALL apoc.redis.pexpire(uri, key, time, true, config)</td><td>PEXPIREAT key milliseconds</td></tr>\n",
    "    <tr><td>CALL apoc.redis.pttl(uri, key, config)</td><td>PTTL key</td></tr>\n",
    "    <tr><td>CALL apoc.redis.persist(uri, key, config)</td><td>PERSIST key</td></tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n",
    "\n",
    "### Redis other commands\n",
    "\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent Redis Command</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.redis.eval(uri, script, outputType, keys, values, config)</td><td>EVAL script numKeys keys values</td></tr>\n",
    "    <tr><td>CALL apoc.redis.info(uri, config)</td><td>INFO</td></tr>\n",
    "    <tr><td>CALL apoc.redis.configGet(uri, parameter, config)</td><td>CONFIG GET parameter</td></tr>\n",
    "    <tr><td>CALL apoc.redis.configSet(uri, parameter, config)</td><td>CONFIG SET parameter value</td></tr>\n",
    "</tbody>\n",
    "</table>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c4a7fa6e",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// `LPUSH key values` command\n",
    "CALL apoc.redis.push(\"redis://redisPass@redis:6379\", \"myListKey\", ['one','two','three'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7d3b4805",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// `LPUSH key values` command\n",
    "CALL apoc.redis.push(\"redis://redisPass@redis:6379\", \"myListKey\", ['four','five'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8ddd6175",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// `RPUSH key values` command\n",
    "CALL apoc.redis.push(\"redis://redisPass@redis:6379\", \"myListKey\", ['zero'], {right: false})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d9711ebd",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "CALL apoc.redis.lrange(\"redis://redisPass@redis:6379\", \"myListKey\", 0 , 10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5e90c932",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// LPOP key, with {right: false} would be RPOP\n",
    "CALL apoc.redis.pop(\"redis://redisPass@redis:6379\", \"myListKey\", {right: false})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "abdda264",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "CALL apoc.redis.lrange(\"redis://redisPass@redis:6379\", \"myListKey\", 0 , 10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b16ad986",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// Lua script\n",
    "// equivalent to `EVAL \"return redis.call('set', KEYS[1], ARGV[1])\" 1 testEval myValueEval`\n",
    "// the number of keys (1) is not needed in the apoc procedure\n",
    "\n",
    "// `VALUE` is the return type of Lua script. \n",
    "// Can be a `BOOLEAN`, `INTEGER`, `STATUS` (ok or err), `VALUE` (others) or `MULTI`.\n",
    "\n",
    "\n",
    "CALL apoc.redis.eval('redis://redisPass@redis:6379', \n",
    "        'return redis.call(\"set\", KEYS[1], ARGV[1])', \n",
    "            'VALUE', \n",
    "            [\"testEval\"], // keys...\n",
    "            [\"myValueEval\"] // argv...\n",
    ");\n",
    "\n",
    "\n",
    "// set a new key\n",
    "CALL apoc.redis.get(\"redis://redisPass@redis:6379\", \"testEval\");\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "efb206e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "CALL apoc.redis.info(\"redis://redisPass@redis:6379\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "518d63ac",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "CALL apoc.redis.configGet(\"redis://redisPass@redis:6379\", \"slowlog-max-len\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "49040508",
   "metadata": {},
   "source": [
    "# MongoDb\n",
    "\n",
    "\n",
    "The `apoc.mongodb.*`, which are deprecated in favor of the `apoc.mongo`.\n",
    "\n",
    "\n",
    "\n",
    "There are two types of procedures.\n",
    "The new procedures:\n",
    "\n",
    "- allow to connect via single string connection url: https://docs.mongodb.com/manual/reference/connection-string/\n",
    "- map configuration param\n",
    "- support MongoDB Extended JSON (v2)\n",
    "\n",
    "The procedures are:\n",
    "\n",
    "- `apoc.mongo.aggregate(uri, pipeline, $config)` - perform an aggregate operation on mongodb collection\n",
    "- `apoc.mongo.count(uri, query, $config)` - perform a count operation on mongodb collection\n",
    "- `apoc.mongo.find(uri, query, $config)` - perform a find operation on mongodb collection\n",
    "- `apoc.mongo.insert(uri, documents, $config)` - inserts the given documents into the mongodb collection\n",
    "- `apoc.mongo.update(uri, query, update, $config)` - updates the given documents from the mongodb collection and returns the number of affected documents\n",
    "- `apoc.mongo.delete(uri, query, $config)` - delete the given documents from the mongodb collection and returns the number of affected documents\n",
    "\n",
    "\n",
    "The `url` parameter is `mongodb://<USER>:<PASSWORD>@<HOST>:<PORT>/<DBNAME>.<COLLECTION>?[OPTIONS]`\n",
    "\n",
    "`$config` --> https://neo4j.com/labs/apoc/5/database-integration/mongo/#mongodb-config\n",
    "\n",
    "\n",
    "#### Note\n",
    "```\n",
    "To use this procedure we need to download an additional jar\n",
    "https://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/download/<APOC_VERSION>/apoc-mongodb-dependencies-<APOC_VERSION>-all.jar,\n",
    "and put in the `plugin` folder.\n",
    "\n",
    "So for example with apoc 5.1.0, `https://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/download/5.1.0/apoc-mongodb-dependencies-5.1.0-all.jar`.\n",
    "\n",
    "```\n",
    "\n",
    "\n",
    "### MongoDb methods\n",
    "\n",
    "\n",
    "<br>\n",
    "<table style=\"width: 90%\">\n",
    "<thead>\n",
    "    <tr><th>APOC Procedure</th><th>Equivalent MongoDb Method</th><th>Link</th></tr>\n",
    "</thead>\n",
    "<tbody>\n",
    "    <tr><td>CALL apoc.mongo.aggregate</td><td>db.collection.aggregate</td><td> https://www.mongodb.com/docs/manual/reference/method/db.collection.aggregate/</td></tr>\n",
    "    <tr><td>CALL apoc.mongo.count</td><td>db.collection.count</td><td> https://www.mongodb.com/docs/manual/reference/method/db.collection.count/</td></tr>\n",
    "    <tr><td>CALL apoc.mongo.find</td><td>db.collection.find</td><td>  https://www.mongodb.com/docs/manual/reference/method/db.collection.find/</td></tr>\n",
    "    <tr><td>CALL apoc.mongo.insert</td><td>db.collection.insertMany</td><td> https://www.mongodb.com/docs/manual/reference/method/db.collection.insertMany/</td></tr>\n",
    "    <tr><td>CALL apoc.mongo.update</td><td>db.collection.updateMany</td><td> https://www.mongodb.com/docs/manual/reference/method/db.collection.updateMany/</td></tr>\n",
    "    <tr><td>CALL apoc.mongo.delete</td><td>db.collection.deleteMany</td><td> https://www.mongodb.com/docs/manual/reference/method/db.collection.deleteMany/</td></tr>\n",
    "</tbody>\n",
    "</table>\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "20d0e25a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// insert documents in Product collection\n",
    "// `$oid` is a MongoDb `ObjectId`\n",
    "\n",
    "// `authSource=admin` means go look in the admin database\n",
    "\n",
    "\n",
    "CALL apoc.mongo.insert(\"mongodb://mongo:password@localhost:27017/sample.Product?authSource=admin\", \n",
    "        [{`_id`: {`$oid`: '57e193d7a9cc81b4027499c4'}, name: \"Product 1\", price: 100},\n",
    "        {`_id`: {`$oid`: '58e193d7a9cc81b4027499c4'}, name: \"Product 2\", price: 200},\n",
    "        {`_id`: {`$oid`: '59e193d7a9cc81b4027499c4'}, name: \"Product 3\", price: 300}   ]\n",
    "         )\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "d7d2f75b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// insert documents in Person collection\n",
    "\n",
    "CALL apoc.mongo.insert(\"mongodb://mongo:password@localhost:27017/sample.Person?authSource=admin\", \n",
    "        [{`_id`: {`$oid`: '57e193d7a9cc81b4027499c4'}, name: \"Al\", price: 100},\n",
    "        {`_id`: {`$oid`: '58e193d7a9cc81b4027499c4'}, name: \"John\", age: 40, foo: \"bar\"},\n",
    "        {`_id`: {`$oid`: '59e193d7a9cc81b4027499c4'}, name: \"Jack\", age: 50, foo: \"bar\"}   ]\n",
    "         )\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "727c7ef9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   value\n",
       "0      0"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "CALL apoc.mongo.update(\"mongodb://mongo:password@localhost:27017/sample.mycollection?authSource=admin\",\n",
    "    {foo: {`$oid`: '57e193d7a9cc81b4027499c4'}}, {`$set`:{code: {`$code`: 'void 0'}}})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "decf5675",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'baz': 12, '_id': '97e193d7a9cc81b4027519b4'}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            value\n",
       "0  {'baz': 12, '_id': '97e193d7a9cc81b4027519b4'}"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// extractReferences from ObjectId -->  it will include the related document instead of the ObjectId\n",
    "\n",
    "CALL apoc.mongo.find(\"mongodb://mongo:password@localhost:27017/sample.mycollection?authSource=admin\",\n",
    "                     {`_id`: {`$oid`: '97e193d7a9cc81b4027519b4'}}, \n",
    "                     {extractReferences: true, objectIdAsMap: false})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "40d202a0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'aggrField': 'Y', 'foo': 'bar', 'name': 'John', '_id': {'date': 1491178455000, 'machineIdentifier': 11127937, 'processIdentifier': -19454, 'counter': 7641540, 'time': 1491178455000, 'timestamp': 1491178455, 'timeSecond': 1491178455}, 'age': 40}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'aggrField': 'Y', 'foo': 'bar', 'name': 'Jack', '_id': {'date': 1507955671000, 'machineIdentifier': 11127937, 'processIdentifier': -19454, 'counter': 7641540, 'time': 1507955671000, 'timestamp': 1507955671, 'timeSecond': 1507955671}, 'age': 50}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                                                                                                                                                                   value\n",
       "0  {'aggrField': 'Y', 'foo': 'bar', 'name': 'John', '_id': {'date': 1491178455000, 'machineIdentifier': 11127937, 'processIdentifier': -19454, 'counter': 7641540, 'time': 1491178455000, 'timestamp': 1491178455, 'timeSecond': 1491178455}, 'age': 40}\n",
       "1  {'aggrField': 'Y', 'foo': 'bar', 'name': 'Jack', '_id': {'date': 1507955671000, 'machineIdentifier': 11127937, 'processIdentifier': -19454, 'counter': 7641540, 'time': 1507955671000, 'timestamp': 1507955671, 'timeSecond': 1507955671}, 'age': 50}"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "CALL apoc.mongo.aggregate(\"mongodb://mongo:password@localhost:27017/sample.Person?authSource=admin\", \n",
    "        [{`$match`: {foo: 'bar'}}, {`$set`: {aggrField: 'Y'} }])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "4e14895b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   value\n",
       "0      3"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "CALL apoc.mongo.count('mongodb://mongo:password@localhost:27017/sample.Person?authSource=admin', {})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6e8c9abe",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# Couchbase\n",
    " \n",
    "\n",
    "\n",
    "- `CALL apoc.couchbase.get(hostOrKey, bucket, documentId, $config)` - Retrieves a couchbase json document by its unique ID\n",
    "\n",
    "- `CALL apoc.couchbase.exists(hostOrKey, bucket, documentId, $config)` - Check whether a couchbase json document with the given ID does exist\n",
    "\n",
    "- `CALL apoc.couchbase.insert(hostOrKey, bucket, documentId, jsonDocument, $config)` - Insert a couchbase json document with its unique ID\n",
    "\n",
    "- `CALL apoc.couchbase.upsert(hostOrKey, bucket, documentId, jsonDocument, $config)` - Insert or overwrite a couchbase json document with its unique ID\n",
    "\n",
    "- `CALL apoc.couchbase.append(hostOrKey, bucket, documentId, jsonDocument, $config)` - Append a couchbase json document to an existing one\n",
    "\n",
    "- `CALL apoc.couchbase.prepend(hostOrKey, bucket, documentId, jsonDocument, $config)` - Prepend a couchbase json document to an existing one\n",
    "\n",
    "- `CALL apoc.couchbase.remove(hostOrKey, bucket, documentId, $config)` - Remove the couchbase json document identified by its unique ID\n",
    "\n",
    "- `CALL apoc.couchbase.replace(hostOrKey, bucket, documentId, jsonDocument, $config)` - Replace the content of the couchbase json document identified by its unique ID.\n",
    "\n",
    "- `CALL apoc.couchbase.query(hostOrKey, bucket, statement, $config)` - Executes a plain un-parameterized N1QL statement.\n",
    "\n",
    "- `CALL apoc.couchbase.posParamsQuery(hostOrKey, bucket, statement, params, $config)` - Executes a N1QL statement with positional parameters.\n",
    "\n",
    "- `CALL apoc.couchbase.namedParamsQuery(hostOrKey, bucket, statement, paramNames, paramValues, $config)` - Executes a N1QL statement with named parameters.\n",
    "\n",
    "\n",
    "\n",
    "- `host` is `couchbase://<username>:<password>:<hostAndPort>`\n",
    "\n",
    "- `statement` are in `N1QL` language\n",
    "\n",
    "\n",
    "Configs: https://neo4j.com/labs/apoc/4.1/database-integration/couchbase/#_configuration_parameters\n",
    "For example `collection` to use a custom collection, (with default: `\"_default\"`)\n",
    "\n",
    "\n",
    "### Example\n",
    "\n",
    "`queryTimeout` in ms.\n",
    "\n",
    "```\n",
    "CALL apoc.couchbase.query(\"couchbase://username:password@localhost:8091\", \n",
    "    'myBucket', \n",
    "    'select * from myBucket where lastName = \"Van Gogh\"',\n",
    "    {queryTimeout: 10000}) \n",
    "```\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe2c3ad8",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# ldap\n",
    "\n",
    "apoc.load.ldap(\"key\" or {connectionMap},{searchMap})\n",
    "\n",
    "Conceptually similar to `apoc.load.csv`.\n",
    "\n",
    "\n",
    "https://neo4j.com/labs/apoc/4.4/database-integration/load-ldap/"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "81d2728b",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# elastic\n",
    "\n",
    "\n",
    "\n",
    "| Procedure      | Operation |\n",
    "| ----------- | ----------- |\n",
    "| apoc.es.stats(host-url-Key) | elastic search statistics\n",
    "| apoc.es.get(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value | perform a GET operation\n",
    "| apoc.es.query(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value | perform a SEARCH operation\n",
    "| apoc.es.getRaw(host-or-port,path,payload-or-null) yield value | perform a raw GET operation\n",
    "| apoc.es.postRaw(host-or-port,path,payload-or-null) yield value | perform a raw POST operation\n",
    "| apoc.es.post(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value | perform a POST operation\n",
    "| apoc.es.put(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value | perform a PUT operation\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "77832cf8",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# apoc.nodes.link\n",
    "\n",
    "- CALL apoc.nodes.link([nodes], '<REL_TYPE>') - creates a linked list of nodes\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c342f6d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "MERGE (:Event {name: \"Event 1\"})\n",
    "MERGE (:Event {name: \"Event 2\"})\n",
    "MERGE (:Event {name: \"Event 3\"});\n",
    "\n",
    "\n",
    "MATCH (e:Event) WITH e ORDER BY e.name\n",
    "WITH collect(e) AS events\n",
    "CALL apoc.nodes.link(events, \"NEXT\")\n",
    "RETURN count(*)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f57cd369",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# apoc.algo.*\n",
    "\n",
    "Based on [org.neo4j.graphalgo.GraphAlgoFactory](https://github.com/dmontag/neo4j-community/blob/master/graph-algo/src/main/java/org/neo4j/graphalgo/GraphAlgoFactory.java).\n",
    "\n",
    "For limited use. \n",
    "For more complex cases use gds.\n",
    "\n",
    "- apoc.algo.aStar\n",
    "- apoc.algo.aStarConfig\n",
    "- apoc.algo.aStarWithPoint\n",
    "- apoc.algo.dijkstra\n",
    "- apoc.algo.allSimplePaths\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "b71b1414",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// dataset\n",
    "\n",
    "CREATE (b:City {name:'Berlin', coords: point({latitude:52.52464,longitude:13.40514}), lat:52.52464,lon:13.40514})\n",
    "CREATE (m:City {name:'München', coords: point({latitude:48.1374,longitude:11.5755}), lat:48.1374,lon:11.5755})\n",
    "CREATE (f:City {name:'Frankfurt',coords: point({latitude:50.1167,longitude:8.68333}), lat:50.1167,lon:8.68333})\n",
    "CREATE (h:City {name:'Hamburg', coords: point({latitude:53.554423,longitude:9.994583}), lat:53.554423,lon:9.994583})\n",
    "CREATE (b)-[:DIRECT {dist:255.64*1000}]->(h)\n",
    "CREATE (b)-[:DIRECT {dist:504.47*1000}]->(m)\n",
    "CREATE (b)-[:DIRECT {dist:424.12*1000}]->(f)\n",
    "CREATE (f)-[:DIRECT {dist:304.28*1000}]->(m)\n",
    "CREATE (f)-[:DIRECT {dist:393.15*1000}]->(h)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "16c009c8",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// # apoc.algo.aStar(startNode, endNode, \n",
    "// #                   relationshipTypesAndDirections, \n",
    "// #                   weightPropertyName, latPropertyName, lonPropertyName)\n",
    "\n",
    "// #https://see here to relationshipTypesAndDirections syntax \n",
    "    // # --> neo4j.com/labs/apoc/4.1/graph-querying/expand-paths-config/#path-expander-paths-config-config-relationship-filters\n",
    "\n",
    "\n",
    "MATCH (from:City {name:'München'}), (to:City {name:'Hamburg'}) \n",
    "CALL apoc.algo.aStar(from, to, 'DIRECT', 'dist', 'lat', 'lon') yield path, weight "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "c3f9a59a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "8b66280ee88a46388b113c56d5cb2951",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "CytoscapeWidget(cytoscape_layout={'name': 'cola', 'padding': 100, 'nodeSpacing': 100, 'edgeLengthVal': 10, 'an…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// # apoc.algo.aStarConfig(startNode, endNode, relTypesAndDirections, config\n",
    "\n",
    "MATCH (from:City {name:'München'}), (to:City {name:'Hamburg'})\n",
    "CALL apoc.algo.aStarConfig(from, to, 'DIRECT', {weight:'dist',y:'lat', x:'lon'})\n",
    "YIELD weight, path\n",
    "RETURN weight, path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "30f7d211",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// pointPropName config\n",
    "\n",
    "MATCH (from:City {name:'München'}), (to:City {name:'Hamburg'}) \n",
    "CALL apoc.algo.aStarConfig(from, to, 'DIRECT', {pointPropName:'coords', weight:'dist'}) yield path, weight \n",
    "RETURN path, weight\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "59e2efa0",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// similar to aStar(), but with point prop\n",
    "\n",
    "MATCH (from:City {name:'München'}), (to:City {name:'Hamburg'}) \n",
    "CALL apoc.algo.aStarWithPoint(from, to, 'DIRECT', 'dist', 'coords') yield path, weight \n",
    "RETURN path, weight"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "67f5f143",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe tex2jax_ignore\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// dataset\n",
    "\n",
    "CREATE  (a:Loc{name:'A'}),\n",
    "  (b:Loc{name:'B'}), \n",
    "  (c:Loc{name:'C'}), \n",
    "  (d:Loc{name:'D'}), \n",
    "  (a)-[:ROAD {d:100}]->(d), \n",
    "  (a)-[:RAIL {d:5}]->(d),\n",
    "  (a)-[:ROAD {d:10}]->(b), \n",
    "  (b)-[:ROAD {d:20}]->(c), \n",
    "  (c)-[:ROAD {d:30}]->(d), \n",
    "  (a)-[:ROAD {d:20}]->(c)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "87f76cea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "18a7b09698384de6a593a533f825c3ff",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "CytoscapeWidget(cytoscape_layout={'name': 'cola', 'padding': 100, 'nodeSpacing': 100, 'edgeLengthVal': 10, 'an…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// apoc.algo.dijkstra(startNode, endNode, relationshipTypesAndDirections, weightPropertyName, defaultWeight, numberOfWantedPaths = 1) \n",
    "\n",
    "MATCH (from:Loc{name:'A'}), (to:Loc{name:'D'}) \n",
    "CALL apoc.algo.dijkstra(from, to, 'ROAD>', 'd', 99999, 3) yield path, weight \n",
    "RETURN path, weight"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "94d988b8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "20e3bedbd3074b47a94542332d48db0f",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "CytoscapeWidget(cytoscape_layout={'name': 'cola', 'padding': 100, 'nodeSpacing': 100, 'edgeLengthVal': 10, 'an…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// apoc.algo.allSimplePaths(startNode, endNode, relationshipTypesAndDirections, maxNodes)\n",
    "\n",
    "MATCH (from:Loc{name:'A'}), (to:Loc{name:'D'}) \n",
    "CALL apoc.algo.allSimplePaths(from, to, 'ROAD>', 3) yield path \n",
    "RETURN path ORDER BY length(path)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f55d5b7",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# apoc.bitbwise.*\n",
    "\n",
    "Bit operations.\n",
    "\n",
    "See here for example: https://www.w3schools.com/js/js_bitwise.asp\n",
    "\n",
    "- apoc.bitwise.op(int1, operator, int2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0ef6a606",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// 5 & 1 is in bits equivalent to -->  0101 & 0001 --> result: 0001\n",
    "\n",
    "RETURN apoc.bitwise.op(5, \"&\", 1) AS output;"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "59c25c94",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "# apoc.generate.*\n",
    "\n",
    "To generate a random graph, based on different models\n",
    "\n",
    "\n",
    "https://neo4j.com/labs/apoc/5/overview/apoc.generate/\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "d249a242",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "2017660fe44f4b25be1a52c1c645c482",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "CytoscapeWidget(cytoscape_layout={'name': 'cola', 'padding': 100, 'nodeSpacing': 100, 'edgeLengthVal': 10, 'an…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "// # Barabasi-Albert model algo, CALL apoc.generate.ba(numberOfNodes,edgesPerNode,label,type)\n",
    "\n",
    "CALL apoc.generate.ba(10,3,'MyLabel1','MY_TYPE_1');\n",
    "\n",
    "MATCH path=(n:MyLabel1)--() RETURN path;"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0792ff3e",
   "metadata": {},
   "source": [
    "<hr style=\"border:1px solid #ccc\"> \n",
    "\n",
    "# Detect cycles - apoc.node.cycles\n",
    "\n",
    "<span style=\"color:#33f\" size=\"7\"> ***For 4.4, introduced in APOC Core 4.4.0.3*** </span>\n",
    "\n",
    "Detect all path cycles from node list.\n",
    "\n",
    "#### Signature\n",
    "```\n",
    "CALL apoc.nodes.cycles([nodes], $config)\n",
    "```\n",
    "\n",
    "where `$config` can have:\n",
    "- `maxDepth`: max number of hops. With 0 we searching for nodes with self-relationships.\n",
    "- `relTypes` (List of Strings): the relationships types to be considered\n",
    "\n",
    "<b>Leverage the `org.neo4j.graphalgo.GraphAlgoFactory.shortestPath(...)` algorithm</b>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f91d1924",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "The below data set consists in a node alpha with 2 cycles, \n",
    "a node beta with 1 cycles, \n",
    "a gamma node without cycles, a node delta with 1 cycle (with only 1 intermediate node), \n",
    "and a epsilon node with a self-relationship:\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8b5839b3",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// 1 mixed-rel cycle\n",
    "CREATE (m1:Start {bar: 'alpha'})-[:DEPENDS_ON {id: 0}]->(m2:Module {bar: 'one'})-[:ANOTHER {id: 1}]->(m3:Module {bar: 'two'})-[:DEPENDS_ON {id: 2}]->(m1),\n",
    "    (m1)-[:SELF_REL]->(m1);\n",
    "\n",
    "// 2 same-rel cycles, of different sizes\n",
    "CREATE (m1:Start {bar: 'gamma'}) with m1 CREATE (m1)-[:DEPENDS_ON {id: 10}]->(m:Module {bar: 'five'})-[:DEPENDS_ON {id: 11}]->(m1);\n",
    "CREATE (m1:Start {bar: 'beta'}) with m1 CREATE (m1)-[:MY_REL {id: 9}]->(m2:Module {bar: 'three'})-[:MY_REL  {id: 10}]->(:Module {bar: 'four'})-[:MY_REL {id: 11}]->(:Module {bar: 'five'})-[:MY_REL {id: 12}]->(:Module {bar: 'six'})-[:MY_REL {id: 11}]->(m1);\n",
    "\n",
    "// results\n",
    "MATCH path=(:Start)-[*]->() return path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4e49a9f8",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// all cycles, !!max hops config. is Integer.MAX_VALUE, so be careful!!\n",
    "MATCH (n:Start) with collect(n) as nodes \n",
    "call apoc.nodes.cycles(nodes) yield path return path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "105d7fe9",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "MATCH (n:Start) with collect(n) as nodes \n",
    "call apoc.nodes.cycles(nodes, {maxDepth: 2}) yield path return path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8299acc0",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// only self-rels\n",
    "MATCH (n:Start) with collect(n) as nodes \n",
    "call apoc.nodes.cycles(nodes, {maxDepth: 0}) yield path return path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fde6e570",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// We can also specify a list of relationship types to detect cycles\n",
    "\n",
    "MATCH (m1:Start) WITH collect(m1) as nodes \n",
    "CALL apoc.nodes.cycles(nodes, {relTypes: [\"DEPENDS_ON\", \"MY_REL\", \"NOT_EXISTENT\"]}) YIELD path RETURN path"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f6d1d2d7",
   "metadata": {},
   "source": [
    "<hr style=\"border:1px solid #ccc\"> \n",
    "\n",
    "# Read file list\n",
    "\n",
    "<span style=\"color:#33f\" size=\"7\"> ***For 4.4, introduced in APOC Full/Extended 4.4.0.3*** </span>\n",
    "\n",
    "Sometimes you may need to load multiple files from a directoriy with the same cypher query.\n",
    "\n",
    "Without this procedure we must necessarily create as many queries as there are files that we have to load.\n",
    "With this procedure we can upload multiple files at the same time.\n",
    "\n",
    "\n",
    "Unlike the other loads, it does not consider a single file, but one or more directories.\n",
    "\n",
    "#### Signature\n",
    "```\n",
    "CALL apoc.load.directory('pattern', 'urlDir', $config) YIELD value\n",
    "```\n",
    "\n",
    "Loads list of all files with a specific `pattern` in folder specified by urlDir or in import folder if `urlDir` string is empty or not specified.\n",
    "\n",
    "By default, it finds recursively into subdirectories.\n",
    "\n",
    "The `pattern` leverage the `new org.apache.commons.io.filefilter.WildcardFileFilter(filter)`\n",
    "\n",
    "\n",
    "For this example we created a directory 'myFolder' and a sub-directory 'mySubFolder'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4b94f24c",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "call apoc.load.directory()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "86b2f739",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "call apoc.load.directory('load*.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f5f63fbd",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// files in subsubfolder\n",
    "CALL apoc.load.directory('*.csv', 'myFolder');"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a51965bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "CALL apoc.load.directory(\"*\", 'myFolder', {recursive: false})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "59299703",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "/* use case example - load multiple file at the same time\n",
    "instead of doing this for each file:\n",
    "CALL apoc.load.csv('file1.csv', {results:['map']}) yield value ... do some ops...;\n",
    "CALL apoc.load.csv('file2.csv', {results:['map']}) yield value ... do some ops...;\n",
    "*/\n",
    "\n",
    "\n",
    "/*  in loadDirSubfolder there are 2 files\n",
    "    fileTest.csv                  fileTest2.csv\n",
    "    ---                           ---\n",
    "    name,surname                  name,surname\n",
    "    Sakura,Haruno                 Eren,Jager\n",
    "    Naruto,Uzumaki                Mikasa,Ackermann\n",
    "    Sasuke,Uchiha                 Armin,Arelet\n",
    "*/\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "CALL apoc.load.directory('fileTest2.csv', 'myFolder/mySubfolder')\n",
    "yield value WITH value\n",
    "CALL apoc.load.csv(url, {results:['map']}) \n",
    "\n",
    "// do some ops...\n",
    "\n",
    "YIELD map RETURN map, url"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "41dc0780",
   "metadata": {},
   "source": [
    "\n",
    "<hr style=\"border:1px solid #ccc\"> \n",
    "\n",
    "# Directory listener\n",
    "\n",
    "<span style=\"color:#33f\" size=\"7\"> ***For 4.4, introduced in APOC Full/Extended 4.4.0.5*** </span>\n",
    "\n",
    "\n",
    "Add a directory listener to handle changes in it, which is triggered when a file is deleted, created or modified.\n",
    "\n",
    "Useful to create a custom data ingestion tool.\n",
    "\n",
    "Very helpful when you’re ingesting data via csv, json, xml, graphML, cypher, because they don’t leverage a Cron job, but they are constantly active; this has several upsides because if a job fail for some reason (e.g. network issues) we don’t need to wait for next cron loop, but we can continue the ingestion right after.\n",
    "\n",
    "Conceptually it works in a very similar way to APOC Triggers, but it leverages the `java.nio.file.WatchService` instead of `org.neo4j.graphdb.event.TransactionEventListener`.\n",
    "\n",
    "\n",
    "#### Signature\n",
    "```\n",
    "apoc.load.directory.async.add(name, cypher, pattern, urlDir, $config)\n",
    "```\n",
    "\n",
    "It adds (or replaces) a folder listener with a specific `name`.\n",
    "\n",
    "\n",
    "\n",
    "The first parameter is the name of our custom watch listener.\n",
    "If we use an already existing listener name, that listener will be overwritten.\n",
    "The second parameter is the cypher query that will be executed.\n",
    "The `cypher` can have the following parameters:\n",
    "\n",
    "* `$fileName`: the name of the file which triggered the event\n",
    "\n",
    "\n",
    "* `$filePath`: the absolute path of the file which triggered the event if `apoc.import.file.use_neo4j_config=false`, otherwise the relative path starting from `$IMPORT_DIR`\n",
    "\n",
    "\n",
    "* `$fileDirectory`: the absolute path directory of the file which triggered the event if `apoc.import.file.use_neo4j_config=false`, otherwise the relative path starting from `$IMPORT_DIR`\n",
    "\n",
    "\n",
    "* `$listenEventType`: the triggered event (`\"CREATE\"`, `\"DELETE\"` or `\"MODIFY\"`). <br> The event `\"CREATE\"` happens when a file is inserted in the folder,\n",
    "`\"DELETE\"` when a file is removed from the folder and `\"MODIFY\"` when a file in the folder is changed. <br>\n",
    "Please note that if a file is renamed, will be triggered 2 events, that is first \"DELETE\" and then\"CREATE\"\n",
    "\n",
    "The third parameter is the pattern of file to search for. By default is '*', that is, search all files. It uses the `WildcardFileFilter` like the `apoc.load.directory` procedure.\n",
    "\n",
    "The fourth is the search path of directory. By default is an empty string, that is, search file in import directory.\n",
    "\n",
    "In `$config` whe can put:\n",
    "- `listenEventType`: List of types of event that execute the cypher query, `CREATE`, `DELETE` or `MODIFY`\n",
    "- `interval` (default: 1000): Interval in ms after re-watch for directory changes\n",
    "\n",
    "\n",
    "\n",
    "Other procedures:\n",
    "- `CALL apoc.load.directory.async.list()`\n",
    "- `CALL apoc.load.directory.async.remove(name)`\n",
    "- `CALL apoc.load.directory.async.removeAll()`\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e068932c",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// when we create a file in `dirAsync`, \n",
    "// we create a node `TestDir` with the file name, the csv map content and the event type\n",
    "\n",
    "CALL apoc.load.directory.async.add('customDirAsync',\n",
    "    \"CALL apoc.load.csv($filePath) \n",
    "        yield map with map create (n:TestDir) \n",
    "        set n.fileName = $fileName, n.event = $listenEventType, n += map\",\n",
    "    \"*.csv\", \n",
    "    \"dirAsync\",\n",
    "    {listenEventType: ['CREATE']})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7ae8893c",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// check results\n",
    "match (n:TestDir) return properties(n)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "debd980b",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// error handling\n",
    "CALL apoc.load.directory.async.add('another', \"CREATE (:Stuff)\", \"*.csv\", \"notExistentPath\")\n",
    "yield name, error"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "234ad312",
   "metadata": {},
   "source": [
    "### Listener list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d7fd5007",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// list\n",
    "CALL apoc.load.directory.async.list"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f19a04a3",
   "metadata": {},
   "source": [
    "### Remove listener"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0cda6748",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "// or via CALL apoc.load.directory.async.remove(<listenerName>)\n",
    "CALL apoc.load.directory.async.removeAll"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a9e36953",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "e0612992",
   "metadata": {},
   "source": [
    "<hr style=\"border:1px solid #ccc\"> \n",
    "\n",
    "# Geocode configuration\n",
    "\n",
    "<span style=\"color:#33f\" size=\"7\"> ***For 4.4, introduced in APOC Core 4.4.0.7*** </span>\n",
    "\n",
    "The [`apoc.spatial.geocode(address, maxRes, quotaException, $config)`](https://neo4j.com/labs/apoc/4.4/overview/apoc.spatial/apoc.spatial.geocode/), \n",
    "[`apoc.spatial.geocodeOnce(address, $config)`](https://neo4j.com/labs/apoc/4.4/overview/apoc.spatial/apoc.spatial.geocodeOnce/) \n",
    "and the [`apoc.spatial.reverseGeocode(latitide, longitude, $config)`](https://neo4j.com/labs/apoc/4.4/overview/apoc.spatial/apoc.spatial.reverseGeocode/),\n",
    "converts a textual address into a location containing latitude, longitude\n",
    "\n",
    "may require additional configuration, for example to use a custom geocode service (i.e. Google or OpenCage) instead of OpenStreetMap (default).\n",
    "\n",
    "Previously they had to be placed in `apoc.conf` or env. variables.\n",
    "\n",
    "From the latest versions, we can instead [set these configurations](https://neo4j.com/labs/apoc/4.4/misc/spatial/#_configure_via_config_parameter_map) also in the `$config` parameter, especially useful for Aura.\n",
    "\n",
    "For example, instead of this procedure:\n",
    "```\n",
    "CALL apoc.spatial.geocodeOnce('<MY_PLACE>')\n",
    "```\n",
    "togheter with this `apoc.conf`:\n",
    "```\n",
    "apoc.spatial.geocode.provider=opencage\n",
    "apoc.spatial.geocode.opencage.key=XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n",
    "apoc.spatial.geocode.opencage.url=http://api.opencagedata.com/geocode/v1/json?q=PLACE&key=KEY\n",
    "apoc.spatial.geocode.opencage.reverse.url=http://api.opencagedata.com/geocode/v1/json?q=LAT+LNG&key=KEY\n",
    "\n",
    "```\n",
    "\n",
    "we can equivalently do this:\n",
    "```\n",
    "CALL apoc.spatial.geocodeOnce('<MY_PLACE>', {\n",
    "  provider: 'opencage',\n",
    "  url: 'http://api.opencagedata.com/geocode/v1/json?q=PLACE&key=KEY',\n",
    "  reverseUrl: 'http://api.opencagedata.com/geocode/v1/json?q=LAT+LNG&key=KEY',\n",
    "  key: 'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'\n",
    "})\n",
    "```\n",
    "\n",
    "So we can pass a provider key, which will be equivalent to `apoc.spatial.geocode.provider` setting key, and the other keys will be equivalent to `apoc.spatial.geocode.<PROVIDER>.<KEY>` settings \n",
    "(note that the `dot.case` keys are converted to `UpperCamelCase`, e.g from `reverseUrl` to `reverse.url`)\n",
    "\n",
    "\n",
    "Moreover, that these configs take precedence over the `apoc.conf` settings."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78d24dcd",
   "metadata": {},
   "source": [
    "<hr style=\"border:1px solid #ccc\"> \n",
    "\n",
    "# Average duration\n",
    "\n",
    "<span style=\"color:#33f\" size=\"7\"> ***For 4.4, introduced in APOC Full/Extended 4.4.0.7*** </span>\n",
    "\n",
    "\n",
    "Apoc provides an `apoc.coll.avgDuration(list)` equivalent to the `apoc.coll.avg(list)` function but accepts duration instead of numbers."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7c6efaaa",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher\n",
    "\n",
    "with [\n",
    "    duration('P2DT3H'), duration('PT1H45S'), duration('P2DT4H'), duration('PT2H45S')\n",
    "] AS durations\n",
    "with apoc.coll.avgDuration(durations) AS value\n",
    "return value.years, value.hours, value.seconds"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "979d62bc",
   "metadata": {},
   "source": [
    "# Path Manipulation\n",
    "\n",
    "4.4 --> https://neo4j.com/labs/apoc/4.4/graph-querying/path-querying/\n",
    "\n",
    "5.x --> https://neo4j.com/docs/apoc/current/graph-querying/path-querying/\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c98b0643",
   "metadata": {},
   "source": [
    "<br><br>\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "## CUSTOM PROCEDURES/FUNCTIONS\n",
    "\n",
    "\n",
    "Afaik, we can create custom procedures and functions only with JVM based languages (Java, Kotlin, Scala....).\n",
    "\n",
    "\n",
    "- From template --> https://github.com/neo4j-examples/neo4j-procedure-template/ and choose branch\n",
    "\n",
    "- Custom APOC 4.x and APOC 5.x Extended Jar --> https://github.com/neo4j-contrib/neo4j-apoc-procedures and choose branch\n",
    "\n",
    "- Custom APOC Core 5.x Jar --> https://github.com/neo4j/apoc and choose branch\n",
    "\n",
    "\n",
    "---\n",
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "33ba24b6",
   "metadata": {},
   "source": [
    "## FEEDBACK FORM\n",
    "\n",
    "### https://forms.gle/6dmCcsS5CbSJEC9p7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9453d764",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  },
  "tags": [
   "hide-input"
  ]
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
